#練習
#1. 4列5元素串列
list1 = [[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]]
print('list1=',list1)       #印出二維串列內容
print('list1[2]=',list1[2]) #印出list1索引值為2的內容
print(len(list1),'列')      #二維串列的列數
print(len(list1[0]),'行')   #二維串列第一列有多少元素
print('list1[2][1]=',list1[2][1])  #二維串列中的特定位置值 在list1中索引值為2的內容([11,12,13,14,15])中 索引值為1的值(12)

#2. 建立空串列&內容的方式
Q = [i for i in range(10)] #一維串列產生1-9
print('Q=',Q)
Q = [0]*10 #一維串列產生10個0
print('Q=',Q)
Q = [[] for i in range(5)] #二維串列產生5個空串列
print('Q=',Q)
Q[1] = [1,3,5] #在Q[1]串列中放置3筆資料
print('Q=',Q)
Q = [[0]*8 for i in range(5)] #5個串列中 每個串列都有8個數字0
print('Q=',Q)
Q = [[a for a in range(1,5)] for i in range(8)] #產生8個串列，每個串列的內容是數字1到4
print('Q=',Q)


